# DimensionCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RepeaterCoordinates..::..DimensionCount Property
RepeaterCoordinates Class See Also
---
The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int DimensionCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DimensionCount As Integer
	Get
```

Visual C++
---
```text
public:
property int DimensionCount {
	int get ();
}
```

# See Also
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace